describe("orderSheet service 테스트", () => {
  // calculation
  describe("주문서에 대한 금액 요약 정보 요청하기", () => {
    describe("주문서에 대한 금액 요약 정보 요청하기", () => {
      it("무료 배송비 정책의 주문 금액에 못 미치고, 모든 쿠폰 적용 불가능한 경우 금액 요약 정보를 반환한다", () => {});

      it("5000원 할인 쿠폰 사용 가능한 금액 요약 정보를 반환한다", () => {});

      it("2+1 쿠폰 사용 가능한 금액 요약 정보를 반환한다", () => {});

      it("무료 배송 쿠폰 사용 가능한 금액 요약 정보를 반환한다", () => {});

      it("30% 시간제 할인 쿠폰 사용 가능한 금액 요약 정보를 반환한다", () => {});
    });
  });

  describe("해당 주문에 대해서 사용가능한 쿠폰 코드 요청하기", () => {
    it("", () => {});
  });

  describe("해당 주문서에서 선택된 쿠폰을 적용했을 때 할인 금액 요청하기", () => {
    it("", () => {});
  });
});
